tap 'caskroom/cask'

# Basic Software
## iWork
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
## iLife
mas 'iMovie', id: 408981434
## Diary app
mas 'Day One', id: 1055511498
## Money app
mas 'Money Pro', id: 972572731
## Speedtest for hard drive
mas 'Blackmagic Disk Speed Test', id: 425264550
## Manage your window position like a pro
mas 'Magnet', id: 441258766
mas 'Moom', id: 419330170
## Twitter app
mas 'Twitter', id: 409789998
## Better twitter app
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
## Color capture
mas 'Sip', id: 507257563
## Contacts manager
mas 'Cobook', id: 525225808
## Typing game
mas 'Type Fu', id: 509818877
## Prevent your mac from sleep
mas 'Caffeine', id: 411246225
## EXIF viewer
mas 'JustExifViewer', id: 980953143
## Beautiful wallpaper
mas 'Irvue', id: 1039633667
## JRE
cask 'java'
## Password manager
cask '1password'
## Browsers
cask 'firefox'
cask 'google-chrome'
## Better email client
cask 'spark'
## IMs
cask 'telegram'
cask 'slack'
cask 'skype'
cask 'whatsapp'
## Better Spotlight
cask 'alfred'
## File sharing
cask 'cloud'
## The Dropbox
cask 'dropbox'
## The Evernote
cask 'evernote'
## Better Evernote
cask 'alternote'
## Better screenshot tool based on evernote
cask 'skitch'
## Night shift your mac
cask 'flux'
## The Kindle
cask 'kindle'
## Markdown writer
cask 'macdown'
## Preview markdown support
cask 'qlmarkdown'
## Better unarchiver
cask 'the-unarchiver'
## Video player
cask 'mplayerx'
cask 'vlc'
## Mac product catalog
cask 'mactracker'
## BBS client
cask 'welly'
## BT client
cask 'utorrent'
## Plex related
cask 'plex-home-theater'
cask 'plex-media-server'

# Development tools
## Better terminal
cask 'iterm2'
## Text Editor
cask 'atom'
cask 'macvim'
cask 'sublime-text'
## Database clients
cask 'psequel'
cask 'sequel-pro'
## Secure tunnel for localhost
cask 'ngrok'
## Homebrew-installed services manager
cask 'launchrocket'
## Image optimizer
cask 'imageoptim'
## FTP client
cask 'transmit'

## Terminal multiplexer
brew 'tmux'
## Better SSH
brew 'mobile-shell'
## The Git
brew 'git'
## The openssl
brew 'openssl'
## GitHub command support git
brew 'hub'
## The vim
brew 'vim'
## ZSH syntax highlighter
brew 'zsh-syntax-highlighting'
## Faster ack
brew 'the_silver_searcher'
## Curl-ish
brew 'wget'
brew 'curl'
brew 'httpie'
## Network traffic intercepter
brew 'mitmproxy'
## Image processor
brew 'graphicsmagick'
brew 'imagemagick'
## EXIF viewer
brew 'exiftool'
## Heroku cli client
brew 'heroku'
## Ruby
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
## Languages
brew 'go'
brew 'python'
brew 'perl'
brew 'node'
## Relational database
brew 'sqlite'
brew 'postgresql'
brew 'pgcli'
brew 'mysql'
## NoSQL database
brew 'redis'
## Memcache
brew 'memcached'
## The ElasticSearch
brew 'elasticsearch'
