# Essentials
cask "iterm2"
brew "zsh-vi-mode"
brew "git"
brew "lazygit"
brew "vim"
brew "tmux"
brew "asdf"
brew "mas"
# Mac App Store version of 1Password 7 doesn't support lifetime license
# download via https://app-updates.agilebits.com/download/OPM7
# mas "1Password 7"                    , id: 1333542190  # 1Password 7
cask "alfred"
cask "obsidian"
# cask "logseq"
# cask "mark-text"
cask "markedit"
cask "sublime-text"
cask "telegram"
cask "welly"  # BBS client
cask "the-unarchiver"
cask "appcleaner"
cask "qlmarkdown"  # markdown quicklook support
cask "iina"
cask "aldente"  # prevent overcharge your mac
mas "Day One"                      , id: 1055511498
mas "Money Pro"                    , id: 972572731
cask "moom"
mas "Magnet"                       , id: 441258766
mas "Irvue"                        , id: 1039633667 # beautiful wallpaper
mas "Amphetamine"                  , id: 937984704  # keep computer awake

# Command Line Tool Essentials
brew "openssl"
brew "ag"  # the silver searcher
brew "fzf"  # fuzzy finder
brew "fd"  # better find
brew "ripgrep"  # better grep
brew "bat"  # better cat
brew "eza"  # better ls
brew "tree"  # show folder as tree
brew "tealdeer"  # fast tldr written in rust
brew "readline"
brew "universal-ctags"
brew "mobile-shell"  # better ssh
# brew "hub"  # github cli
brew "gh"  # github official cli app
brew "curl"
# not fast for man: https://github.com/zdharma-continuum/fast-syntax-highlighting/issues/27
# brew "zsh-fast-syntax-highlighting"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "powerlevel10k"
brew "timewarrior"

# More brew
brew "wget"
# brew "sqlite"
# brew "postgresql@16"
# brew "pgcli"
# brew "mysql"
# brew "redis"
# brew "perl"
# brew "heroku"
# brew "httpie"
# brew "mitmproxy"  # network traffic intercepter
# brew "memcached"
# brew "elasticsearch"
# brew "imagemagick"  # image processor
# brew "graphicsmagick"  # better imagemagick
# brew "exiftool"
# brew "ffmpeg"
# brew "handbrake"
# brew "youtube-dl"
brew "yt-dlp"

# More cask
# cask "istat-menus"
cask "firefox"
cask "adguard"
# cask "hiddenbar"
cask "transmit"
cask "plex"
cask "maestral"  # open-source dropbox client
# cask "bike"
cask "aerial"
# cask "transmission"
# cask "sequel-pro"
# cask "macs-fan-control"
# cask "macvim"
# cask "openbb-terminal"
# cask "google-chrome"
# cask "slack"
# cask "skype"
# cask "telegram-desktop"
# cask "discord"
# cask "docker"
# cask "dropbox"
# cask "java"
# cask "ngrok"
# cask "psequel"
# cask "launchrocket"  # homebrew services macOS manager
# cask "imageoptim"
# cask "cloud"  # file sharing
# cask "vlc"
# cask "mactracker"  # apple products catalog
# cask "plex-media-server"

# More mas
mas "Pages"                        , id: 409201541
mas "Numbers"                      , id: 409203825
mas "Keynote"                      , id: 409183694
mas "iMovie"                       , id: 408981434
mas "Bears", id: 1536711520
mas "Cardhop", id: 1290358394
mas "PCalc", id: 403504866
# mas "Pocket", id: 568494494
# mas "Reeder", id: 1449412482
mas "Save to Matter", id: 1548677272
# mas "Save to Pocket", id: 1477385213
mas "Trello", id: 1278508951
# mas "Tweetbot", id: 1384080005
# mas "Tweetbot", id: 557168941
# mas "Vimari", id: 1480933944
# mas "Xcode"                      , id: 497799835
mas "Drafts", id: 1435957248
# mas "Hush", id: 1544743900
# mas "Instapaper", id: 288545208
# mas "Instapaper Save", id: 1481302432
# mas "Sip"                        , id: 507257563  # color capture
# mas "JustExifViewer"             , id: 980953143
# mas "Cobook"                     , id: 525225808  # contacts management
# mas "Blackmagic Disk Speed Test" , id: 425264550
# mas "Type Fu"                    , id: 509818877  # typing game
# mas "Exporter", id: 1099120373
# mas "Little Snitch Mini", id: 1629008763
# mas "OpenConv", id: 892308325
